[MID_CreditsIntro_KDD]
[eng]
This is the fourth end-of-game scrolling text thing I've written.  Usually, when I write them, it's at the end of a bitter and grueling release cycle, and I feel like I've just spent the last two years climbing from the bottom of a hundred-foot well.  That will make me want to tell everyone just how bad the whole game development process is like I'm some kind of stoic hero whose soul-scarring sacrifices need to be appreciated.

But not this time!  No, I'm in a pretty good mood as I write this, so for once, I'm not going to bring everybody down.  Yeah, everyone breathe a sigh of relief.  Hey, you busted some butt to get through this game!  It's a hard game, so you must have enjoyed yourself to put forth the effort.  So I'm happy that you liked it that much!

King Dugan's Dungeon is the largest collection of puzzles that I personally wrote.  I made something like 320 of the rooms back in the mid-nineties, with Lucas Swineford creating the rest of the rooms we used for the original release.  Then in 2005, Neil Frederick and several other people added more rooms.  There are now well over 350 rooms.  We always say "over 350" or "350+" these days.  It's bad luck to say the exact count, kind of like how actors aren't supposed to say "MacBeth".

There are three or four sets of credits for King Dugan's Dungeon, due to the multiple releases we've had.  It really gets to be terribly complex describing it all.  In these particular credits, I'm only going to describe the people who worked on the latest release of KDD and its companion hold, the Choice.  For a complete list of people involved, you can find credits on our website and the in-game help for the various predecessors of this game.
[rus]
Ох, это уже четвертый вариант финального текста, что я пишу. Делать это после двух лет непрерывной работы - бессонных ночей, поисков оптимальных решений того или иного вопроса, технических и административных препонов – прямо скажем, тяжело. Такое впечатление, что все это время ты карабкался к свету со дна глубокого заброшенного колодца.  Причем так и подмывает начать рассказ о создании игры тоном героя, который, жертвуя собой, в очередной раз спасает мир и ждет, что его подвиг будет по достоинству оценен человечеством.

Вот уж и нет! Я в прекрасном расположении духа, так что не бойтесь - всякое нытье отменяется! Так, чувствую, вы облегченно вздохнули. Расслабьтесь. Вам и так пришлось нелегко – чтобы пройти эту игру, надо было напрячься не по-детски. Она действительно очень трудная, так что вы вполне можете гордиться тем, что справились. И я безмерно счастлив, что она вам понравилась!

"Подземелье короля Дугана" - самая большая коллекция головоломок, которую я написал. Еще в середине девяностых мною было создано более 320 комнат, а Лукас Свайнфорд - автор остальных комнат, вошедших в первоначальное издание. Затем в 2005 году Нейл Фредерик и несколько других соавторов добавили в игру еще одну порцию комнат. Теперь их более 350. Мы говорим или пишем так: "более 350", "350+", а все потому, что считаем, объявлять их точное количество - плохая примета. Ну, ведь актеры, например, не произносят слово "Макбет", так что мы тоже решили побыть немножко суеверными.

У нас выпущено уже несколько игр, поэтому существует три или четыре списка создателей. Рассказывать обо всех становится все труднее. Сегодня я упомяну только тех, кто работал над последней версией "ПКД" и его крепостью-спутницей "Выбором". Полный список всех участвовавших в создании более ранних версий игры можно найти на нашем веб-сайте и в "Помощи" игры.

[MID_ErikH_C_KDD]
[eng]
(voice coordination)
[rus]
(координатор озвучания)

[MID_ErikH_Text_KDD]
[eng]
On this release of King Dugan's Dungeon, I did very little.  I actually begged Mike to handle as much of the project as he could.  You have to understand that I've worked on these levels off and on for a decade now.  I can look at a single KDD room and it evokes stapled concert announcements from 1995 rotting off a telephone pole.  So I'm just a little tired of KDD.  All I did on this release was edit the scripted dialogue a bit to give Beethro a consistent style of speaking, and then coordinated with Sten and the other actors to get lines recorded.
[rus]
Мой вклад в эту версию игры "Подземелье короля Дугана" невелик. Если честно, я свалил львиную долю работы на Майка, впрочем, он не очень возражал. Вся штука в том, что над созданием этих уровней я работал более десяти лет назад. Сейчас иногда смотришь на ту или иную комнату, и в голову приходит сравнение с пожелтевшей обтрепанной афишей, наклеенной на телефонный столб году так в 1995-м. Вот поэтому-то работа над игрой меня почти не напрягала. В этот раз я занимался только редактированием диалогов, чтобы придать фразам Битро характерные и узнаваемые нотки, и координацией озвучания – надо сказать, Стен и другие актеры старались изо всех сил.

[MID_NeilF_C_KDD]
[eng]
(Level Design and Testing, Acting)
[rus]
(Разработка и тестирование уровней, озвучание)

[MID_NeilF_Text_KDD]
[eng]
Neil was the main man on this project.  He contributed the majority of extra rooms to KDD and is the author of The Choice.  The voices for goblins and mud coordinators in KDD are his, as well as the mud brain in The Choice.  He's had a long history with Caravel projects and is always a good person to have on the team.
[rus]
Нейл вложил в этот проект больше, чем кто бы то ни было еще. Большинство дополнительных комнат "ПКД" придумано и сделано им. Кроме того, он является автором всей крепости "Выбор". И озвучил гоблинов и координаторов грязи тоже он, и мозг грязи в "Выборе" – это опять же Нейл. Он уже давно трудится в рамках проектов компании "Caravel" и работать с ним одно удовольствие.

[MID_MikeR_C_KDD]
[eng]
(Project Management, Level Design and Testing, Voice Editing)
[rus]
(Управление проектом, разработка и тестирование уровней, редактор озвучания)

[MID_MikeR_Text_KDD]
[eng]
Mike kept a top-level view of the project and made sure it moved forward.  He made extra rooms for KDD, and handled merging other people's rooms into the hold.  He's also gotten very good at chopping up big wave files into small wave files and plugging them into holds, and he handled this rather tedious editing task.
[rus]
Майк руководил всем проектом в целом и обеспечивал его постоянное поступательное движение. Он создал дополнительные комнаты для «ПКД» и объединил комнаты, сделанные другими авторами, в одну крепость. Кроме того, он очень умело нарезал большие звуковые файлы на множество мелких и занимался утомительным редактированием всего этого многоголосья.

[MID_OtherActors_KDD]
[eng]
Sten Ryason, Gregory Butts, Chris Marks, Michael Boulton
[rus]
Стен Райасон, Грегори Баттс, Крис Маркс, Майкл Бултон

[MID_OtherActors_C_KDD]
[eng]
Acting
[rus]
Озвучание

[MID_OtherActors_Text_KDD]
[eng]
These fellows, along with Neil, made up our acting troupe for the project.  Sten was the voice of Beethro and the 'Neather;  Gregory played Halph; Chris made the odd robotic voice of a character we call the "Simulacrum"; and Michael played the Tar Brain.
[rus]
Эти ребята вместе с Нейлом - актерская труппа нашего проекта. Стен озвучивал Битро и Подземника, Грегори - Хэльфа, Крис издавал необычные механические звуки персонажа, которого мы называем "Подобие", а Майкл выступил в роли мозга смолы.

[MID_OtherDesigners_KDD]
[eng]
Matthew Schikore, Eytan Zweig, Matthew Cramp, Clayton Weiss, Adam Peterson, Chris Marks
[rus]
Мэттью Шикор, Этан Цвейг, Мэттью Крамп, Клейтон Вайс, Адам Петерсон, Крис Маркс

[MID_OtherDesigners_C_KDD]
[eng]
(Level Design and Testing)
[rus]
(Разработка и тестирование уровней)

[MID_OtherDesigners_Text_KDD]
[eng]
These guys contributed extra rooms, suggested and made corrections, and helped to debug the room design.  All of them are hardcore DROD fans that have been playing the game for years, and we are lucky to have such commitment.
[rus]
Эти парни создали дополнительные комнаты, предлагали и вносили всяческие исправления и улучшения, а также помогли избавиться от ошибок в конструкции комнат. Все они настоящие фанаты "DROD", играют в нее много лет, и нам очень повезло, что они с нами сотрудничают.

[MID_CreditsLastWords_KDD]
[eng]
I just have to check one thing.  You *did* find and conquer all the secret rooms, didn't you?  And you saw what was behind the Master Doors?  It really isn't my business to bother you with it, I guess, but I just want to make sure you're getting the full experience.

Thanks for playing!  Extra thanks to the oldtimers who played through KDD in both the original and improved form.


-Erik
[rus]
Осталось только кое-что проверить. Вы нашли и очистили все тайные комнаты, верно? И видели, что находится за "главными дверями"? Это, конечно, не мое дело... Я просто хочу убедиться, что эта игра доставила вам максимум удовольствия.

Спасибо, что играли! Особая благодарность давним поклонникам игры, которые прошли ПКД и в оригинальной, и в улучшенной версии.


-Эрик

[MID_CreditsTheEnd_KDD]
[eng]
King Dugan's Dungeon

(c) 2005, 2007, 2016 Caravel Games, LLC
www.caravelgames.com
